Repository: JosiasDMartins/SweetMoney
Catalog: locale/*/LC_MESSAGES/django.po
Languages: pt_br

source: A Flow Group with the name '%(name)s' already exists in this period.
pt_br: Um Grupo de Fluxo com o nome '%(name)s' já existe neste período.

source: Password
pt_br: Senha

source: Role
pt_br: Função

source: User's preferred language
pt_br: Idioma preferido do usuário

source: Current system version (e.g., 1.0.0, 1.0.0-alpha1, 1.0.0-beta1, 2.0.0)
pt_br: Versão atual do sistema (por exemplo, 1.0.0, 1.0.0-alpha1, 1.0.0-beta1, 2.0.0)

source: System Version
pt_br: Versão do sistema

source: System Versions
pt_br: Versões do sistema

source: Version that was skipped (e.g., 1.0.0-alpha5)
pt_br: Versão que foi ignorada (por exemplo, 1.0.0-alpha5)

source: Skipped Update
pt_br: Atualização ignorada

source: Skipped Updates
pt_br: Atualizações ignoradas

source: Admin
pt_br: Administrador

source: Parent
pt_br: Pai

source: Child
pt_br: Criança

source: Monthly
pt_br: Mensal

source: Bi-weekly
pt_br: Quinzenal

source: Weekly
pt_br: Semanalmente

source: Day of the month (1-31) that defines the cycle start.
pt_br: Dia do mês (1-31) que define o início do ciclo.

source: Base currency for the family (e.g., USD, BRL, EUR)
pt_br: Moeda base da família (por exemplo, USD, BRL, EUR)

source: Start date of the period
pt_br: Data de início do período

source: End date of the period
pt_br: Data final do período

source: Type of period
pt_br: Tipo de período

source: Currency for this period
pt_br: Moeda para este período

source: Income
pt_br: Renda

source: Main Expense (Essential)
pt_br: Despesa Principal (Essencial)

source: Secondary Expense (Non-Essential)
pt_br: Despesa Secundária (Não Essencial)

source: Start date of the period this FlowGroup belongs to
pt_br: Data de início do período ao qual este FlowGroup pertence

source: If True, this group is visible and editable by all Parents and Admins
pt_br: Se for verdade, este grupo ficará visível e editável por todos os pais e administradores

source: Parents and Admins who have access to this Shared group
pt_br: Pais e administradores que têm acesso a este grupo compartilhado

source: Children who have access to this Kids group
pt_br: Crianças que têm acesso a este grupo Kids

source: For credit card groups: marks if the bill has been closed and paid
pt_br: Para grupos de cartões de crédito: marca se a fatura foi fechada e paga

source: Whether this transaction has been consolidated/completed
pt_br: Se esta transação foi consolidada/concluída

source: True if this is an expense added to a FlowGroup by a CHILD user)
pt_br: Verdadeiro se esta for uma despesa adicionada a um FlowGroup por um usuário CHILD)

source: If True, this transaction will be auto-copied to new periods
pt_br: Se for verdade, esta transação será copiada automaticamente para novos períodos

source: Start date of the period this role applies to
pt_br: Data de início do período ao qual esta função se aplica

source: Description of the bank account
pt_br: Descrição da conta bancária

source: Current bank balance
pt_br: Saldo bancário atual

source: Date of balance check
pt_br: Data da verificação do saldo

source: Period this balance belongs to
pt_br: Período ao qual este saldo pertence

source: Overdue Transaction
pt_br: Transação vencida

source: Over Budget
pt_br: Acima do orçamento

source: New Transaction
pt_br: Nova transação

source: 5-digit verification code sent to user's email
pt_br: Código de verificação de 5 dígitos enviado para o e-mail do usuário

source: Transaction '%(description)s' is %(days)d day overdue
pt_br: A transação '%(description)s' está com %(days)d dias de atraso

source: Transaction '%(description)s' is %(days)d days overdue
pt_br: A transação '%(description)s' está com %(days)d dias de atraso

source: '%(name)s' is over budget by %(amount)s
pt_br: '%(name)s' ultrapassou o orçamento em %(amount)s

source: Someone
pt_br: Alguém

source: %(creator)s added '%(description)s' in '%(group)s'
pt_br: %(creator)s adicionou '%(description)s' em '%(group)s'

source: Flow Group
pt_br: Grupo de Fluxo

source: Back
pt_br: Voltar

source: Group
pt_br: Grupo

source: Discard
pt_br: Descartar

source: Save
pt_br: Salvar

source: Mark this group as recurring to automatically copy it to new periods
pt_br: Marque este grupo como recorrente para copiá-lo automaticamente para novos períodos

source: Recurrent
pt_br: Recorrente

source: Budget Given:
pt_br: Orçamento fornecido:

source: Group Name
pt_br: Nome do grupo

source: Budgeted Amount
pt_br: Valor orçado

source: Read-only for children
pt_br: Somente leitura para crianças

source: Shared Group
pt_br: Grupo Compartilhado

source: No Parents/Admins
pt_br: Sem pais/administradores

source: Kids
pt_br: Crianças

source: No children in family
pt_br: Sem filhos na família

source: Investment
pt_br: Investimento

source: Credit Card
pt_br: Cartão de crédito

source: Please correct the errors below:
pt_br: Corrija os erros abaixo:

source: Budget Warning:
pt_br: Aviso de Orçamento:

source: Estimated expenses ($ %(estimated)s) exceed the budgeted amount
pt_br: Despesas estimadas ($ %(estimated)s) excedem o valor orçado

source: Description
pt_br: Descrição

source: Date
pt_br: Data

source: Member
pt_br: Membro

source: Realized
pt_br: Realizado

source: Fixed
pt_br: Fixo

source: Amount
pt_br: Quantia

source: Actions
pt_br: Ações

source: Mark as recurring expense
pt_br: Marcar como despesa recorrente

source: No transactions found for this Flow Group.
pt_br: Nenhuma transação encontrada para este Grupo Flow.

source: New Item Description
pt_br: Descrição do novo item

source: Add New Item
pt_br: Adicionar novo item

source: Realized:
pt_br: Realizado:

source: Estimated expenses
pt_br: Despesas estimadas

source: exceed the budgeted amount
pt_br: excedem o valor orçado

source: ✓ Marked as given
pt_br: ✓ Marcado como dado

source: Not given yet
pt_br: Ainda não foi dado

source: Budget marked as given to child
pt_br: Orçamento marcado como dado à criança

source: Budget marked as not given
pt_br: Orçamento marcado como não fornecido

source: A network error occurred.
pt_br: Ocorreu um erro de rede.

source: Group marked as recurring - will be copied to new periods
pt_br: Grupo marcado como recorrente – será copiado para novos períodos

source: Group is no longer recurring
pt_br: O grupo não é mais recorrente

source: Error updating recurring status:
pt_br: Erro ao atualizar o status recorrente:

source: Bill marked as closed and paid
pt_br: Fatura marcada como fechada e paga

source: Bill marked as not closed
pt_br: Projeto de lei marcado como não fechado

source: items marked as realized
pt_br: itens marcados como realizados

source: Please save the Flow Group first before marking it as closed.
pt_br: Salve o grupo de fluxo antes de marcá-lo como fechado.

source: Please save the Flow Group first before marking it as realized.
pt_br: Salve o grupo de fluxo antes de marcá-lo como realizado.

source: Please save the Flow Group first before marking it as recurring.
pt_br: Salve o grupo de fluxo antes de marcá-lo como recorrente.

source: Please save the transaction first before marking it as fixed.
pt_br: Salve a transação antes de marcá-la como fixa.

source: Transaction marked as fixed - will be copied to new periods
pt_br: Transação marcada como fixa – será copiada para novos períodos

source: Transaction is no longer fixed
pt_br: A transação não é mais fixa

source: WARNING: All transactions in this group for the current period will be permanently deleted. This action cannot be undone.
pt_br: AVISO: Todas as transações neste grupo para o período atual serão excluídas permanentemente. Esta ação não pode ser desfeita.

source: Are you sure you want to delete this Flow Group?
pt_br: Tem certeza de que deseja excluir este Grupo de Fluxo?

source: Flow Group deleted successfully
pt_br: Grupo de fluxo excluído com sucesso

source: Error deleting Flow Group:
pt_br: Erro ao excluir o Grupo de Fluxo:

source: Are you sure you want to delete this item?
pt_br: Tem certeza de que deseja excluir este item?

source: Description, Amount, and Date are required.
pt_br: Descrição, valor e data são obrigatórios.

source: Duplicate Name
pt_br: Nome Duplicado

source: A network error occurred while saving order.
pt_br: Ocorreu um erro de rede ao salvar o pedido.

source: Please enter a description
pt_br: Por favor insira uma descrição

source: Error saving balance:
pt_br: Erro ao salvar saldo:

source: Network error occurred
pt_br: Ocorreu um erro de rede

source: Warning: Discrepancy Detected
pt_br: Aviso: discrepância detectada

source: The difference between your bank balance and calculated balance is greater than %(discrepancy_percentage_tolerance)s%%. Please review your transactions.
pt_br: A diferneça entre o balanço da conta bancária e o balanço calculado é maior do que %(discrepancy_percentage_tolerance)s%%. Por favor reveja suas transações

source: Reconciliation OK
pt_br: Reconciliação OK

source: Your bank balance matches your calculated balance within acceptable limits.
pt_br: O balanço de sua conta bancária está detro dos limites aceitáveis em relação ao o balanço calculado.

source: Back to Dashboard
pt_br: Voltar ao painel

source: Bank Reconciliation
pt_br: Reconciliação Bancária

source: General
pt_br: Em geral

source: Detailed (by User)
pt_br: Detalhado (por usuário)

source: Current Bank Balances
pt_br: Saldos bancários atuais

source: User
pt_br: Usuário

source: Family
pt_br: Família

source: No bank balances entered yet. Click "Add Bank Balance" to start.
pt_br: Nenhum saldo bancário inserido ainda. Clique em "Adicionar Saldo Bancário" para começar.

source: Bank account name
pt_br: Nome da conta bancária

source: Add Bank Balance
pt_br: Adicionar saldo bancário

source: Total Bank Balance:
pt_br: Saldo Bancário Total:

source: General Reconciliation (Family)
pt_br: Reconciliação Geral (Família)

source: Total Income
pt_br: Renda total

source: Total Expenses
pt_br: Despesas totais

source: Calculated Balance
pt_br: Saldo calculado

source: Bank Balance
pt_br: Saldo Bancário

source: Discrepancy
pt_br: Discrepância

source: Detailed Reconciliation (by User)
pt_br: Reconciliação detalhada (por usuário)

source: Expenses
pt_br: Despesas

source: Calculated
pt_br: Calculado

source: SweetMoney | Family Financial Flow
pt_br: SweetMoney | Fluxo Financeiro Familiar

source: Error loading period details:
pt_br: Erro ao carregar detalhes do período:

source: An error occurred while loading period details
pt_br: Ocorreu um erro ao carregar os detalhes do período

source: New SweetMoney version available!
pt_br: Nova versão do SweetMoney disponível!

source: Installed:
pt_br: Instalado:

source: Available:
pt_br: Disponível:

source: To update, please reinstall the app.
pt_br: Para atualizar, reinstale o aplicativo.

source: Click OK to dismiss this message.
pt_br: Clique em OK para dispensar esta mensagem.

source: To install this app on your iPhone/iPad:
pt_br: Para instalar este aplicativo no seu iPhone/iPad:

source: Tap the Share button (square with arrow)
pt_br: Toque no botão Compartilhar (quadrado com seta)

source: Notification
pt_br: Notificação

source: Warning
pt_br: Aviso

source: Error
pt_br: Erro

source: Success
pt_br: Sucesso

source: Confirm Action
pt_br: Confirmar Ação

source: Cancel
pt_br: Cancelar

source: Continue
pt_br: Continuar

source: Yes
pt_br: Sim

source: No
pt_br: Não

source: Close
pt_br: Fechar

source: Creating...
pt_br: Criando...

source: An error occurred while creating the period
pt_br: Ocorreu um erro ao criar o período

source: An error occurred while deleting the period
pt_br: Ocorreu um erro ao excluir o período

source: Dashboard
pt_br: Painel

source: Investments
pt_br: Investimentos

source: Settings
pt_br: Configurações

source: View profile
pt_br: Ver perfil

source: Logout
pt_br: Sair

source: Update Available
pt_br: Atualização disponível

source: Create New Period
pt_br: Criar novo período

source: New Period
pt_br: Novo período

source: Delete Current Period
pt_br: Excluir período atual

source: Delete Period
pt_br: Excluir período

source: No periods available
pt_br: Não há períodos disponíveis

source: Mark all as read
pt_br: Marcar tudo como lido

source: Toggle Dark Mode
pt_br: Alternar modo escuro

source: Administrator Account
pt_br: Conta de administrador

source: I Agree
pt_br: Concordo

source: Start Date
pt_br: Data de início

source: End Date
pt_br: Data de término

source: Create
pt_br: Criar

source: Loading period details...
pt_br: Carregando detalhes do período...

source: This action cannot be undone!
pt_br: Esta ação não pode ser desfeita!

source: Period:
pt_br: Período:

source: Period Summary
pt_br: Resumo do Período

source: Flow Groups:
pt_br: Grupos de fluxo:

source: Transactions:
pt_br: Transações:

source: Key Metrics
pt_br: Métricas-chave

source: Income (Estimated)
pt_br: Renda (estimada)

source: Income (Realized)
pt_br: Renda (Realizada)

source: Expenses (Estimated)
pt_br: Despesas (estimadas)

source: Expenses (Realized)
pt_br: Despesas (Realizadas)

source: I understand the consequences and want to proceed.
pt_br: Entendo as consequências e quero prosseguir.

source: An error occurred while saving configuration. Please try again.
pt_br: Ocorreu um erro ao salvar a configuração. Por favor, tente novamente.

source: Creating backup...
pt_br: Criando backup...

source: Failed to create backup:
pt_br: Falha ao criar backup:

source: No file selected
pt_br: Nenhum arquivo selecionado

source: Please select a backup file first
pt_br: Selecione um arquivo de backup primeiro

source: No File Selected
pt_br: Nenhum Arquivo Selecionado

source: Confirm Database Restore
pt_br: Confirmar Restauração do Banco de Dados

source: Restoring a backup will replace ALL current data in your database. This action cannot be undone.
pt_br: Restaurar um backup substituirá TODOS os dados atuais no seu banco de dados. Esta ação não pode ser desfeita.

source: It is strongly recommended to create a backup of your current database before proceeding.
pt_br: É fortemente recomendado criar um backup do seu banco de dados atual antes de prosseguir.

source: Do you want to continue with the restore operation?
pt_br: Deseja continuar com a operação de restauração?

source: Restoring...
pt_br: Restaurando...

source: Confirm Migration
pt_br: Confirmar Migração

source: The following will happen:
pt_br: O seguinte acontecerá:

source: Current PostgreSQL database will be backed up
pt_br: O banco de dados PostgreSQL atual será copiado

source: All current PostgreSQL data will be dropped
pt_br: Todos os dados atuais do PostgreSQL serão removidos

source: SQLite data will be migrated to PostgreSQL
pt_br: Os dados do SQLite serão migrados para PostgreSQL

source: Do you want to proceed with the migration?
pt_br: Deseja prosseguir com a migração?

source: Migration Successful
pt_br: Migração Bem-sucedida

source: Database migrated successfully from SQLite to PostgreSQL! Redirecting to login page...
pt_br: Banco de dados migrado com sucesso de SQLite para PostgreSQL! Redirecionando para a página de login...

source: Migration Failed
pt_br: Migração Falhou

source: Failed to migrate backup:
pt_br: Falha ao migrar backup:

source: Details:
pt_br: Detalhes:

source: Restore Successful
pt_br: Restauração Bem-Sucedida

source: Database restored successfully! Redirecting to login page...
pt_br: Banco de dados restaurado com sucesso! Redirecionando para a página de login...

source: Restore Failed
pt_br: Restauração Falhou

source: Failed to restore backup:
pt_br: Falha ao restaurar o backup:

source: Restore Error
pt_br: Erro na Restauração

source: View only
pt_br: Somente visualizar

source: No members found in the family.
pt_br: Nenhum membro encontrado na família.

source: Add
pt_br: Adicionar

source: Application Settings
pt_br: Configurações do aplicativo

source: Configuration
pt_br: Configuração

source: Members
pt_br: Membros

source: Backup & Restore
pt_br: Backup e restauração

source: Updates
pt_br: Atualizações

source: Access Restricted
pt_br: Acesso restrito

source: Base Currency
pt_br: Moeda base

source: All financial values will be stored and displayed in this currency. Changing this will not convert existing values.
pt_br: Todos os valores financeiros serão armazenados e exibidos nesta moeda. Alterar isso não converterá valores existentes.

source: Period Frequency
pt_br: Frequência do período

source: Admin only
pt_br: Somente administrador

source: Starting Day of Month
pt_br: Dia de início do mês

source: Base Date for Cycle
pt_br: Data Base do Ciclo

source: Reference date used to calculate bi-weekly or weekly periods.
pt_br: Data de referência utilizada para cálculo de períodos quinzenais ou semanais.

source: Bank Reconciliation Tolerance (%%)
pt_br: Tolerância à reconciliação bancária (%%)

source: Percentage tolerance for bank reconciliation discrepancy warnings (e.g., 5.00 for 5%%).
pt_br: Percentual de tolerância para avisos de divergência na conciliação bancária (ex: 5.00 para 5%%).

source: Add New Member
pt_br: Adicionar novo membro

source: Note:
pt_br: Observação:

source: As a Parent, you can only add Child users.
pt_br: Como Pai, você só pode adicionar usuários Filhos.

source: Edit
pt_br: Editar

source: Change Password
pt_br: Alterar a senha

source: Remove
pt_br: Remover

source: Edit Member
pt_br: Editar membro

source: Username
pt_br: Nome de usuário

source: Save Changes
pt_br: Salvar alterações

source: New Password
pt_br: Nova Senha

source: from the family?
pt_br: da família?

source: Backup Database
pt_br: Banco de dados de backup

source: Download Database Backup
pt_br: Baixar backup do banco de dados

source: Restore Database
pt_br: Restaurar banco de dados

source: Restore your database from a previously saved backup file.
pt_br: Restaure seu banco de dados a partir de um arquivo de backup salvo anteriormente.

source: Restoring a backup will replace your current database. This action cannot be undone.
pt_br: Restaurar um backup substituirá seu banco de dados atual. Esta ação não pode ser desfeita.

source: Click to select a backup file
pt_br: Clique para selecionar um arquivo de backup

source: Restore Complete
pt_br: Restauração concluída

source: Family:
pt_br: Família:

source: Users:
pt_br: Usuários:

source: Current System Version
pt_br: Versão atual do sistema

source: Check for Online Updates
pt_br: Verifique se há atualizações on-line

source: Check GitHub repository for the latest available release.
pt_br: Verifique o repositório GitHub para a versão mais recente disponível.

source: Check for Updates
pt_br: Verifique se há atualizações

source: System is up to date!
pt_br: O sistema está atualizado!

source: Latest version:
pt_br: Versão mais recente:

source: Local updates pending
pt_br: Atualizações locais pendentes

source: Please apply local updates first before checking for online updates.
pt_br: Aplique as atualizações locais primeiro, antes de verificar se há atualizações on-line.

source: Error deleting item:
pt_br: Erro ao excluir o item:

source: Only Parents/Admins can change this status
pt_br: Somente pais/administradores podem alterar esse status

source: Others
pt_br: Outros

source: Trend
pt_br: Tendência

source: ⚠ Over budget
pt_br: ⚠ Acima do orçamento

source: Top Expenses
pt_br: Principais despesas

source: Expense History (Last 12 Periods)
pt_br: Histórico de despesas (últimos 12 períodos)

source: Key Metrics (YTD)
pt_br: Principais métricas (acumulado no ano)

source: YTD Income
pt_br: Renda acumulada no ano

source: YTD Savings
pt_br: Economia acumulada no ano

source: YTD Investments
pt_br: Investimentos acumulados no ano

source: Highest Expense
pt_br: Grupo de despesas mais alto

source: Income Commitment
pt_br: Compromisso de Renda

source: Expense Flow Groups
pt_br: Grupos de Despesas

source: Add Group
pt_br: Adicionar grupo

source: Estimated
pt_br: Estimado

source: Spent Total
pt_br: Total gasto

source: Child Group
pt_br: Grupo infantil

source: No expense groups defined. Click \
pt_br: Nenhum grupo de despesas definido. Clique em \

source: Recent Income
pt_br: Renda recente

source: Add Income
pt_br: Adicionar renda

source: Only Parents/Admins can change this
pt_br: Somente pais/administradores podem alterar isso

source: Kids Budget
pt_br: Orçamento infantil

source: No income transactions recorded yet.
pt_br: Nenhuma transação de renda registrada ainda.

source: Child Income
pt_br: Renda Infantil

source: %(name)s's Manual Income:
pt_br: Renda manual de %(name)s:

source: Balance Sheet
pt_br: Balanço

source: Result
pt_br: Resultado

source: Family Investments
pt_br: Investimentos Familiares

source: Available Investment Balance
pt_br: Saldo de Investimento Disponível

source: From investment Flow Groups (realized transactions)
pt_br: De grupos de fluxo de investimento (transações realizadas)

source: Coming Soon
pt_br: Em breve

source: The investments management interface is currently under development.
pt_br: A interface de gestão de investimentos está atualmente em desenvolvimento.

source: Soon you'll be able to track and manage your family investments directly from this page.
pt_br: Em breve você poderá acompanhar e gerenciar os investimentos da sua família diretamente desta página.

source: Logged Out | SweetMoney
pt_br: Desconectado | SweetMoney

source: Logged Out Successfully
pt_br: Desconectado com sucesso

source: You have been logged out of your SweetMoney account.
pt_br: Você foi desconectado da sua conta SweetMoney.

source: Redirecting to login page in <span id="countdown">3</span> seconds...
pt_br: Redirecionando para a página de login em <span id="countdown">3</span> segundos...

source: Return to Login Now
pt_br: Voltar para fazer login agora

source: Offline
pt_br: Desconectado

source: Server is Taking a Nap
pt_br: O Servidor está Tirando uma Soneca

source: Oops! Looks like the SweetMoney server is sleeping or your internet is playing hide and seek. Don't worry, we'll keep trying to wake it up!
pt_br: Opa! Parece que o servidor do SweetMoney está dormindo ou sua internet está brincando de esconde-esconde. Não se preocupe, vamos continuar tentando acordá-lo!

source: Attempting to reconnect...
pt_br: Tentando reconectar...

source: Try Again Now
pt_br: Tentar Novamente

source: Tip: Check if your internet is working or if the server is running.
pt_br: Dica: Verifique se sua internet está funcionando ou se o servidor está rodando.

source: Set New Password - SweetMoney
pt_br: Definir nova senha - SweetMoney

source: Set New Password
pt_br: Definir nova senha

source: Enter new password
pt_br: Digite a nova senha

source: Must be at least 8 characters long
pt_br: Deve ter pelo menos 8 caracteres

source: Confirm new password
pt_br: Confirme a nova senha

source: Password strength:
pt_br: Força da senha:

source: Reset Password
pt_br: Redefinir senha

source: Cancel and return to login
pt_br: Cancelar e retornar ao login

source: Weak
pt_br: Fraco

source: Fair
pt_br: Justo

source: Strong
pt_br: Forte

source: Passwords do not match. Please try again.
pt_br: As senhas não coincidem. Por favor, tente novamente.

source: Password must be at least 8 characters long.
pt_br: A senha deve ter pelo menos 8 caracteres.

source: Reset Password - SweetMoney
pt_br: Redefinir senha - SweetMoney

source: Enter your username or email to receive a verification code
pt_br: Digite seu nome de usuário ou e-mail para receber um código de verificação

source: Username or Email
pt_br: Nome de usuário ou e-mail

source: Enter your username or email
pt_br: Digite seu nome de usuário ou e-mail

source: Send Verification Code
pt_br: Enviar código de verificação

source: ← Back to Login
pt_br: ← Voltar para Login
