Repository: JosiasDMartins/SweetMoney
Catalog: locale/*/LC_MESSAGES/django.po
Languages: pt_br

source: A verification code will be sent to your registered email address.
pt_br: Um código de verificação será enviado para o seu endereço de e-mail cadastrado.

source: Verify Code - SweetMoney
pt_br: Código de verificação - SweetMoney

source: Verify Code
pt_br: Verifique o código

source: Enter the 5-digit code sent to %(email)s
pt_br: Digite o código de 5 dígitos enviado para %(email)s

source: Your code has expired. Please request a new one.
pt_br: Seu código expirou. Solicite um novo.

source: Enter the 5-digit code from your email
pt_br: Digite o código de 5 dígitos do seu e-mail

source: Didn't receive the code? Resend
pt_br: Não recebeu o código? Reenviar

source: Check your spam folder if you don't see the email.
pt_br: Verifique sua pasta de spam caso não veja o e-mail.

source: Period Configuration Change
pt_br: Alteração na configuração do período

source: Current
pt_br: Atual

source: Type:
pt_br: Tipo:

source: Days:
pt_br: Dias:

source: New
pt_br: Novo

source: Adjustment
pt_br: Ajuste

source: Actions:
pt_br: Ações:

source: Save configuration
pt_br: Salvar configuração

source: Create adjustment period
pt_br: Criar período de ajuste

source: Create new period
pt_br: Criar novo período

source: Copy FlowGroups
pt_br: Copiar FlowGroups

source: Move transactions
pt_br: Mover transações

source: I understand and confirm these changes
pt_br: Entendo e confirmo essas alterações

source: My Profile
pt_br: Meu perfil

source: Email (Optional)
pt_br: E-mail (opcional)

source: Save Profile
pt_br: Salvar perfil

source: Language Preference
pt_br: Preferência de idioma

source: Preferred Language
pt_br: Idioma preferido

source: Update Language
pt_br: Atualizar idioma

source: Current Password
pt_br: Senha atual

source: Minimum 6 characters
pt_br: Mínimo 6 caracteres

source: Confirm New Password
pt_br: Confirme a nova senha

source: SweetMoney - Initial Setup
pt_br: SweetMoney - Configuração inicial

source: Setting Up Database
pt_br: Configurando banco de dados

source: Please wait while we prepare your system...
pt_br: Aguarde enquanto preparamos seu sistema...

source: Database Setup Complete!
pt_br: Configuração do banco de dados concluída!

source: All database tables have been created successfully.
pt_br: Todas as tabelas do banco de dados foram criadas com sucesso.

source: Continue to Setup Form
pt_br: Continuar para o formulário de configuração

source: Migration Error
pt_br: Erro de migração

source: Retry Setup
pt_br: Tentar novamente a configuração

source: Running database migrations...
pt_br: Executando migrações de banco de dados...

source: Welcome to SweetMoney
pt_br: Bem-vindo ao SweetMoney

source: Family Financial Flow
pt_br: Fluxo Financeiro Familiar

source: First Time Setup
pt_br: Configuração pela primeira vez

source: Database Error
pt_br: Erro de banco de dados

source: Restore from Backup
pt_br: Restaurar do backup

source: or
pt_br: ou

source: New Installation
pt_br: Nova instalação

source: Choose Backup File
pt_br: Escolha o arquivo de backup

source: Backup Information:
pt_br: Informações de backup:

source: Restore Backup
pt_br: Restaurar backup

source: Choose a username
pt_br: Escolha um nome de usuário

source: your@email.com
pt_br: seu@email.com

source: Re-enter your password
pt_br: Digite novamente sua senha

source: Family Information
pt_br: Informações familiares

source: Family Name
pt_br: Nome de família

source: e.g., Smith Family
pt_br: por exemplo, Família Smith

source: Currency Settings
pt_br: Configurações de moeda

source: Financial Cycle Settings
pt_br: Configurações do Ciclo Financeiro

source: Budget resets weekly
pt_br: O orçamento é redefinido semanalmente

source: What happens next?
pt_br: O que acontece a seguir?

source: Your family account will be created
pt_br: Sua conta familiar será criada

source: You'll be logged in as the administrator
pt_br: Você estará logado como administrador

source: You can start managing your family's finances immediately
pt_br: Você pode começar a administrar as finanças da sua família imediatamente

source: You can add other family members from the Settings page
pt_br: Você pode adicionar outros membros da família na página Configurações

source: Complete Setup & Get Started
pt_br: Conclua a configuração e comece

source: © 2025 SweetMoney - Family Financial Flow Management
pt_br: © 2025 SweetMoney - Gestão do Fluxo Financeiro Familiar

source: Server returned non-JSON response. Please check server logs.
pt_br: O servidor retornou uma resposta não JSON. Verifique os logs do servidor.

source: Database restored successfully!
pt_br: Banco de dados restaurado com sucesso!

source: Note: Some migrations encountered warnings. Check console for details.
pt_br: Observação: algumas migrações encontraram avisos. Verifique o console para obter detalhes.

source: Database structure updated to latest version.
pt_br: Estrutura do banco de dados atualizada para a versão mais recente.

source: Click OK to go to login page.
pt_br: Clique em OK para ir para a página de login.

source: Restore failed:
pt_br: Falha na restauração:

source: Unknown error
pt_br: Erro desconhecido

source: Local updates are available and must be applied before continuing.
pt_br: Atualizações locais estão disponíveis e devem ser aplicadas antes de continuar.

source: System files have been updated. Database migrations will be applied.
pt_br: Os arquivos do sistema foram atualizados. As migrações de banco de dados serão aplicadas.

source: A new version is available on GitHub!
pt_br: Uma nova versão está disponível no GitHub!

source: Skip Update
pt_br: Pular atualização

source: Applying Updates...
pt_br: Aplicando atualizações...

source: Preparing update...
pt_br: Preparando atualização...

source: Applying updates...
pt_br: Aplicando atualizações...

source: Update complete!
pt_br: Atualização concluída!

source: Installing GitHub Update...
pt_br: Instalando a atualização do GitHub...

source: Downloading release...
pt_br: Baixando lançamento...

source: Extracting files...
pt_br: Extraindo arquivos...

source: Updates applied successfully! Waiting for server to restart...
pt_br: Atualizações aplicadas com sucesso! Aguardando a reinicialização do servidor...

source: GitHub update installed successfully! Waiting for server to restart...
pt_br: Atualização do GitHub instalada com sucesso! Aguardando a reinicialização do servidor...

source: Update failed. Check logs for details.
pt_br: Falha na atualização. Verifique os registros para obter detalhes.

source: Failed to apply updates
pt_br: Falha ao aplicar atualizações

source: Failed to install update
pt_br: Falha ao instalar a atualização

source: Failed to check for updates. Please try again.
pt_br: Falha ao verificar atualizações. Por favor, tente novamente.

source: Failed to skip update. Please try again.
pt_br: Falha ao pular a atualização. Por favor, tente novamente.

source: Please confirm that you have created a backup before proceeding.
pt_br: Confirme se você criou um backup antes de continuar.

source: Server is taking longer than expected to restart.
pt_br: O servidor está demorando mais do que o esperado para reiniciar.

source: Please wait a moment and then
pt_br: Por favor, espere um momento e então

source: click here to reload
pt_br: clique aqui para recarregar

source: No logs available yet. Please apply an update first.
pt_br: Nenhum registro disponível ainda. Aplique uma atualização primeiro.

source: Backup created successfully! File will be downloaded.
pt_br: Backup criado com sucesso! O arquivo será baixado.

source: Local updates cannot be skipped. They are required for the system to function correctly.
pt_br: As atualizações locais não podem ser ignoradas. Elas são necessárias para o sistema funcionar corretamente.

source: Are you sure you want to skip this update? You won't be notified about this version again until a newer version is released.
pt_br: Tem certeza de que deseja ignorar esta atualização? Você não será notificado sobre esta versão novamente até que uma versão mais recente seja lançada.

source: Failed to skip update:
pt_br: Falha ao ignorar atualização:

source: Logs modal element not found in the page.
pt_br: Elemento modal de logs não encontrado na página.

source: Logs content element not found in the page.
pt_br: Elemento de conteúdo de logs não encontrado na página.

source: System Update Available
pt_br: Atualização do sistema disponível

source: A new version is available!
pt_br: Uma nova versão está disponível!

source: Current Version:
pt_br: Versão atual:

source: New Version:
pt_br: Nova versão:

source: Update Scripts to Apply:
pt_br: Atualizar scripts para aplicar:

source: Backup Recommended
pt_br: Backup recomendado

source: Before applying updates, create a database backup to protect your data.
pt_br: Antes de aplicar atualizações, crie um backup do banco de dados para proteger seus dados.

source: I have created a backup and want to proceed with the update
pt_br: Criei um backup e quero prosseguir com a atualização

source: New Release
pt_br: Novo lançamento

source: Loading release notes...
pt_br: Carregando notas de versão...

source: Released:
pt_br: Lançado:

source: Read full release notes
pt_br: Leia as notas de lançamento completas

source: Container Update Required
pt_br: Atualização do contêiner necessária

source: Backup Required
pt_br: Backup necessário

source: Before installing, create a database backup to protect your data.
pt_br: Antes de instalar, crie um backup do banco de dados para proteger seus dados.

source: Preparing...
pt_br: Preparando...

source: Update Successful!
pt_br: Atualização bem-sucedida!

source: Your system has been successfully updated.
pt_br: Seu sistema foi atualizado com sucesso.

source: Update Failed
pt_br: Falha na atualização

source: An error occurred during the update process.
pt_br: Ocorreu um erro durante o processo de atualização.

source: View Release on GitHub
pt_br: Veja a versão no GitHub

source: Remind Me Later
pt_br: Lembre-me mais tarde

source: Apply Updates
pt_br: Aplicar atualizações

source: Install Update
pt_br: Instalar atualização

source: Close & Reload
pt_br: Fechar e recarregar

source: View Logs
pt_br: Ver registros

source: Update Logs
pt_br: Atualizar registros

source: Loading logs...
pt_br: Carregando registros...

source: Login | SweetMoney
pt_br: Entrar | SweetMoney

source: Access your Family Financial Flow
pt_br: Acesse o fluxo financeiro da sua família

source: Demo Mode
pt_br: Modo de demonstração

source: Visit the GitHub repository for more information →
pt_br: Visite o repositório GitHub para mais informações →

source: Your username and password didn't match. Please try again.
pt_br: Seu nome de usuário e senha não correspondem. Por favor, tente novamente.

source: Forgot your password?
pt_br: Esqueceu sua senha?

source: Log In
pt_br: Conecte-se

source: No backup file provided
pt_br: Nenhum arquivo de backup fornecido

source: Database restored successfully
pt_br: Banco de dados restaurado com sucesso

source: Not an AJAX request.
pt_br: Não é uma solicitação AJAX.

source: User is not associated with a family.
pt_br: O usuário não está associado a uma família.

source: No items data provided.
pt_br: Nenhum dado de item fornecido.

source: A server error occurred: %(error)s
pt_br: Ocorreu um erro no servidor: %(error)s

source: Missing required fields.
pt_br: Campos obrigatórios ausentes.

source: Amount cannot be empty.
pt_br: O valor não pode estar vazio.

source: Invalid amount format: %(amount)s
pt_br: Formato de valor inválido: %(amount)s

source: You don't have permission to edit this group.
pt_br: Você não tem permissão para editar este grupo.

source: Invalid data format: %(error)s
pt_br: Formato de dados inválido: %(error)s

source: Missing transaction_id.
pt_br: Transaction_id ausente.

source: You don't have permission to delete from this group.
pt_br: Você não tem permissão para excluir deste grupo.

source: Only Parents and Admins can mark Kids groups as realized.
pt_br: Somente Pais e Administradores podem marcar grupos de Crianças como realizados.

source: Missing flow_group_id.
pt_br: Flow_group_id ausente.

source: Can only toggle realized for Kids groups.
pt_br: Só é possível alternar entre grupos infantis.

source: Only Parents and Admins can mark Credit Card groups as closed.
pt_br: Somente pais e administradores podem marcar grupos de cartão de crédito como fechados.

source: Can only toggle closed for Credit Card groups.
pt_br: Só é possível alternar para fechado para grupos de cartão de crédito.

source: No groups data provided.
pt_br: Nenhum dado de grupo fornecido.

source: Permission denied.
pt_br: Permissão negada.

source: Flow Group '%(name)s' and all its data have been deleted.
pt_br: O grupo de fluxo '%(name)s' e todos os seus dados foram excluídos.

source: Only Admins and Parents can copy period data.
pt_br: Somente administradores e pais podem copiar dados do período.

source: Current period already has data. Cannot copy.
pt_br: O período atual já possui dados. Não é possível copiar.

source: Copied %(groups)s groups and %(transactions)s transactions.
pt_br: Copiados %(groups)s grupos e %(transactions)s transações.

source: Error copying period: %(error)s
pt_br: Erro ao copiar período: %(error)s

source: Error checking period: %(error)s
pt_br: Período de verificação de erros: %(error)s

source: User not in family
pt_br: O usuário não é da família

source: Permission denied
pt_br: Permissão negada

source: End date must be after start date
pt_br: A data de término deve ser posterior à data de início

source: This period overlaps with existing periods
pt_br: Este período se sobrepõe a períodos existentes

source: No overlap detected
pt_br: Nenhuma sobreposição detectada

source: Family configuration not found
pt_br: Configuração familiar não encontrada

source: Period created successfully
pt_br: Período criado com sucesso

source: Children cannot mark groups as recurring.
pt_br: As crianças não podem marcar grupos como recorrentes.

source: FlowGroup ID is required
pt_br: O ID do FlowGroup é obrigatório

source: You do not have permission to modify this FlowGroup.
pt_br: Você não tem permissão para modificar este FlowGroup.

source: Recurring status updated successfully
pt_br: Status recorrente atualizado com sucesso

source: Children cannot mark transactions as fixed.
pt_br: Os filhos não podem marcar transações como fixas.

source: Transaction ID is required
pt_br: O ID da transação é obrigatório

source: You do not have permission to modify this transaction.
pt_br: Você não tem permissão para modificar esta transação.

source: Fixed status updated successfully
pt_br: Status corrigido atualizado com sucesso

source: Child users cannot access investments.
pt_br: Os usuários infantis não podem acessar investimentos.

source: Database setup required. Running migrations...
pt_br: Configuração do banco de dados necessária. Executando migrações...

source: Database error: %(error)s
pt_br: Erro no banco de dados: %(error)s

source: An error occurred during setup: %(error)s. Please try again.
pt_br: Ocorreu um erro durante a configuração: %(error)s. Por favor, tente novamente.

source: Profile editing is disabled in demo mode.
pt_br: A edição de perfil está desabilitada no modo de demonstração.

source: This username is already taken.
pt_br: Este nome de usuário já está em uso.

source: Profile updated successfully.
pt_br: Perfil atualizado com sucesso.

source: Username cannot be empty.
pt_br: O nome de usuário não pode ficar vazio.

source: Current password is incorrect.
pt_br: A senha atual está incorreta.

source: New password must be at least 6 characters long.
pt_br: A nova senha deve ter pelo menos 6 caracteres.

source: New passwords do not match.
pt_br: As novas senhas não coincidem.

source: Password changed successfully.
pt_br: Senha alterada com sucesso.

source: Language preference updated successfully.
pt_br: Preferência de idioma atualizada com sucesso.

source: Invalid language selection.
pt_br: Seleção de idioma inválida.

source: Database backups are disabled in demo mode.
pt_br: Os backups de banco de dados são desabilitados no modo de demonstração.

source: Backup downloads are disabled in demo mode.
pt_br: Os downloads de backup estão desabilitados no modo de demonstração.

source: Backup file not found
pt_br: Arquivo de backup não encontrado

source: Invalid file path
pt_br: Caminho de arquivo inválido

source: Database restore is disabled in demo mode.
pt_br: A restauração do banco de dados está desabilitada no modo de demonstração.

source: Migration Required
pt_br: Migração Necessária

source: The backup file is from SQLite, but your system is running PostgreSQL. The data will be migrated from SQLite to PostgreSQL. This operation will drop all current data in PostgreSQL. Do you want to proceed?
pt_br: O arquivo de backup é do SQLite, mas seu sistema está executando PostgreSQL. Os dados serão migrados do SQLite para PostgreSQL. Esta operação eliminará todos os dados atuais no PostgreSQL.

source: Member not found
pt_br: Membro não encontrado

source: You are not associated with any family.
pt_br: Você não está associado a nenhuma família.

source: Child users cannot access system settings.
pt_br: Os usuários infantis não podem acessar as configurações do sistema.

source: Only Admins and Parents can access configuration.
pt_br: Somente administradores e pais podem acessar a configuração.

source: Bank reconciliation tolerance updated successfully!
pt_br: Tolerância de reconciliação bancária atualizada com sucesso!

source: Configuration updated successfully!
pt_br: Configuração atualizada com sucesso!

source: Budget cannot exceed your available balance (%(balance)s).
pt_br: O orçamento não pode exceder seu saldo disponível (%(balance)s).

source: Flow Group '%(name)s' created.
pt_br: Grupo de fluxo '%(name)s' criado.

source: You don't have permission to access this group.
pt_br: Você não tem permissão para acessar este grupo.

source: Flow Group '%(name)s' updated.
pt_br: Grupo de fluxo '%(name)s' atualizado.

source: User creation is disabled in demo mode.
pt_br: A criação de usuários está desabilitada no modo de demonstração.

source: Parents can only create CHILD users.
pt_br: Os pais só podem criar usuários CHILD.

source: You do not have permission to create users.
pt_br: Você não tem permissão para criar usuários.

source: Member '%(username)s' added successfully!
pt_br: Membro '%(username)s' adicionado com sucesso!

source: Error creating member: %(error)s
pt_br: Erro ao criar membro: %(error)s

source: User editing is disabled in demo mode.
pt_br: A edição do usuário está desabilitada no modo de demonstração.

source: You do not have permission to edit this user.
pt_br: Você não tem permissão para editar este usuário.

source: Username already taken.
pt_br: Nome de usuário já utilizado.

source: Member information updated successfully.
pt_br: Informações do membro atualizadas com sucesso.

source: Password changes are disabled in demo mode.
pt_br: As alterações de senha são desativadas no modo de demonstração.

source: You do not have permission to change this user's password.
pt_br: Você não tem permissão para alterar a senha deste usuário.

source: Password must be at least 6 characters long.
pt_br: A senha deve ter pelo menos 6 caracteres.

source: Passwords do not match.
pt_br: As senhas não coincidem.

source: User deletion is disabled in demo mode.
pt_br: A exclusão do usuário está desabilitada no modo de demonstração.

source: You cannot remove yourself from the family.
pt_br: Você não pode se afastar da família.

source: Parents can only remove CHILD users.
pt_br: Os pais só podem remover usuários CHILD.

source: You do not have permission to remove this user.
pt_br: Você não tem permissão para remover este usuário.

source: Member %(username)s has been removed from the family.
pt_br: O membro %(username)s foi removido da família.

source: Investment added.
pt_br: Investimento adicionado.

source: Password reset is disabled in demo mode.
pt_br: A redefinição de senha está desabilitada no modo de demonstração.

source: Password reset is not available. Email system is not configured.
pt_br: A redefinição de senha não está disponível. O sistema de e-mail não está configurado.

source: Please enter your username or email.
pt_br: Por favor, digite seu nome de usuário ou e-mail.

source: A verification code has been sent to your email address.
pt_br: Um código de verificação foi enviado para seu endereço de e-mail.

source: Password reset is not available.
pt_br: A redefinição de senha não está disponível.

source: No password reset request found. Please start the process again.
pt_br: Nenhuma solicitação de redefinição de senha encontrada. Por favor, reinicie o processo.

source: Invalid reset request. Please start again.
pt_br: Solicitação de redefinição inválida. Por favor, comece de novo.

source: Please enter the verification code.
pt_br: Por favor, insira o código de verificação.

source: Invalid verification code. Please try again.
pt_br: Código de verificação inválido. Por favor, tente novamente.

source: Code verified! You can now set your new password.
pt_br: Código verificado! Agora você pode definir sua nova senha.

source: No verified reset request found. Please start the process again.
pt_br: Nenhuma solicitação de redefinição verificada foi encontrada. Por favor, reinicie o processo.

source: Your verification code has expired. Please request a new one.
pt_br: Seu código de verificação expirou. Solicite um novo.

source: Please fill in both password fields.
pt_br: Por favor preencha ambos os campos de senha.

source: No password reset request found.
pt_br: Nenhuma solicitação de redefinição de senha encontrada.

source: User not found.
pt_br: Usuário não encontrado.

source: A new verification code has been sent to your email.
pt_br: Um novo código de verificação foi enviado para seu e-mail.

source: Failed to send email. Please try again later. Error: %(error)s
pt_br: Falha ao enviar e-mail. Por favor, tente novamente mais tarde. Erro: %(error)s

source: Missing required parameter: zipball_url
pt_br: Parâmetro obrigatório ausente: zipball_url

source: Could not verify GitHub release information
pt_br: Não foi possível verificar as informações de lançamento do GitHub

source: Invalid download URL
pt_br: URL de download inválido

source: Could not determine target version from GitHub
pt_br: Não foi possível determinar a versão de destino do GitHub

source: Local updates cannot be skipped
pt_br: As atualizações locais não podem ser ignoradas

source: Version is required
pt_br: A versão é obrigatória
